app/controllers/admin_controller.rb

  def index
  @user=User.find_by_myid(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."myid" IN ('danman01')) LIMIT 1