app/controllers/groups_controller.rb

SELECT * FROM "groups"
---
  def index
    @groups = Group.all

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
---
  def show
    @group = Group.find(params[:id])

INSERT INTO "groups" ("name", "created_at", "updated_at", "contact") VALUES('STS', '2010-06-24 15:42:38', '2010-06-24 15:42:38', 'Matt Braun - 706 542 9982')
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save