app/controllers/locations_controller.rb

SELECT * FROM "locations"
---
  def index
    @locations = Location.all