app/controllers/reservations_controller.rb

SELECT * FROM "reservations"
---
  def index
    @reservations = Reservation.all

SELECT * FROM "reservations" WHERE ("reservations"."id" = 11)
---
  def show
    @reservation = Reservation.find(params[:id])

SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"=94237))
INSERT INTO "reservations" ("fulfilled", "reserved_until", "trip_id", "created_at", "comments", "reserved_from", "updated_at", "user_id", "vehicle_id") VALUES(0, '2010-07-14 14:43:00', NULL, '2010-07-14 14:31:19', '', '2010-07-14 14:31:00', '2010-07-14 14:31:19', 'sang1989', 94132)
---
  def create
    @reservation = Reservation.new(params[:reservation])
    @vehicle = Vehicle.find(@reservation.vehicle_id)

    respond_to do |format|
      if @reservation.save