app/controllers/trips_controller.rb

  def index
	  @trips = Trip.find(:all)

	#@trips = Trip.paginate :page => params[:page], :per_page =>'15', :order => 'trip_id ASC'
	@current_trips= Trip.find_current_trips
---
SELECT * FROM "trips"

  def show_all
@trips = Trip.paginate :page => params[:page], :per_page =>'15', :order => 'trip_id ASC'  end
  def show
    @trip = Trip.find(params[:id])
    @vehicle = Vehicle.find_by_vehicleID(@trip.vehicle_id)
---
SELECT * FROM "trips" ORDER BY trip_id ASC LIMIT 15 OFFSET 0
SELECT count(*) AS count_all FROM "trips"
SELECT * FROM "trips" WHERE ("trips"."trip_id" = 1214)
SELECT * FROM "vehicles" WHERE ("vehicles"."vehicleID" = '94237') LIMIT 1

  def new
    @trip = Trip.new
    @v = Vehicle.find(params[:id])
  	@reservations=Reservation.find_all_by_vehicle_id(@v.id)
---
SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94132'))
SELECT * FROM "reservations" WHERE ("reservations"."vehicle_id" IN ('94132'))

  def return
    @trip = Trip.find(params[:id])
    @trip.check_in_time = Time.now
    @nice_time = @trip.check_in_time.strftime("%a, %b %e at %l:%M %p")
      @vehicle = Vehicle.find(@trip.vehicle_id)
  		new = {:checked_out => 0}
  		@vehicle.update_attributes(new)
---
SELECT * FROM "trips" WHERE ("trips"."trip_id" = 1214)
SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94237'))
UPDATE "trips" SET "check_in_time" = '2010-06-24 14:38:48' WHERE "trip_id" = 1214
UPDATE "vehicles" SET "hows_my_driving" = '906LR', "alias" = 'Power Van', "needs_gas" = 0, "service_comments" = '', "reserved" = 0, "checked_out" = 0, "image_url" = '/images/94237.jpg', "needs_service" = 1, "service_timestamp" = NULL, "year_made" = 2002, "model" = 'Windstar', "parking_id" = '11047036', "make" = 'Ford', "owner" = 'STS' WHERE ("vehicleID" = '94237')

  def create
    @trip = Trip.new(params[:trip])
    @vehicle = Vehicle.find(@trip.vehicle_id)
    if @vehicle.checked_out?
      flash[:notice] = 'This vehicle is already in use!  Select a different one, dawg'
      redirect_to :back
    else


      respond_to do |format|
        if @trip.save
---
SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94327'))
INSERT INTO "trips" ("comments", "check_out_time", "check_in_time", "vehicle_id", "myid", "reservation_id", "destination_name") VALUES('', '2010-06-24 14:38:00', NULL, '94327', 'ahalpern', NULL, 'Alpha Chi Omega Sorority')
UPDATE "vehicles" SET "hows_my_driving" = '076LR', "alias" = 'Therapist Van', "needs_gas" = 0, "service_comments" = 'On 4/16/2010: On 4/13/2010: On 3/31/2010: ', "reserved" = 0, "checked_out" = 1, "image_url" = '/images/94327.jpg', "needs_service" = 0, "service_timestamp" = NULL, "year_made" = 2003, "model" = 'E150 Cargo Van', "parking_id" = '11047028', "make" = 'Ford', "owner" = 'NOC' WHERE ("vehicleID" = '94327')

  def update
    @trip = Trip.find(params[:id])

    respond_to do |format|
      if @trip.update_attributes(params[:trip])
---
SELECT * FROM "trips" WHERE ("trips"."trip_id" = 1222)
UPDATE "trips" SET "comments" = 'sdfg' WHERE "trip_id" = 1222

  def destroy
    @trip = Trip.find(params[:id])
    @trip.destroy
    @vehicle = Vehicle.find(@trip.vehicle_id)
    if @vehicle.checked_out = 1
		new = {:checked_out => 0}
		@vehicle.update_attributes(new)
---
SELECT * FROM "trips" WHERE ("trips"."trip_id" = 1222)
DELETE FROM "trips" WHERE "trip_id" = 1222
SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94237'))
UPDATE "vehicles" SET "hows_my_driving" = '906LR', "alias" = 'Power Van', "needs_gas" = 1, "service_comments" = 'On 7/14/2010: ', "reserved" = 0, "checked_out" = 0, "image_url" = '/images/94237.jpg', "needs_service" = 1, "service_timestamp" = NULL, "year_made" = 2002, "model" = 'Windstar', "parking_id" = '11047036', "make" = 'Ford', "owner" = 'STS' WHERE ("vehicleID" = '94237')