app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE (role ='admin')

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("user_group", "salt", "logged_in", "role", "hashed_password", "user_lname", "user_fname", "password", "user_email", "myid") VALUES ('STS', NULL, 0, 'user', NULL, 'bill', 'bill', NULL, 'bill@bill.uga.edu', 'bill')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "role" = 'admin', "salt" = '21822807600.546442422102839', "user_email" = 'danman01@uga.edu', "hashed_password" = 'c42e1096c1dc5a589fea41849d94fedaaebe4e9b', "user_fname" = 'Danny', "user_lname" = 'Kirschner', "logged_in" = 1, "password" = 'horse', "user_group" = 'STS' WHERE ("myid" = 'danman01')