app/controllers/vehicles_controller.rb

SELECT * FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all

SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94237'))
SELECT * FROM "reservations" WHERE ("reservations"."fulfilled" = 0) AND (("reservations"."vehicle_id" = '94237'))
---
  def show
    @vehicle = Vehicle.find(params[:id])
    @reservations = @vehicle.reservations.find_all_by_fulfilled(0)

SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94132'))
---
  def edit
    @vehicle = Vehicle.find(params[:id])

INSERT INTO "vehicles" ("model", "reserved", "needs_gas", "service_comments", "image_url", "checked_out", "year_made", "service_timestamp", "parking_id", "make", "alias", "needs_service", "owner", "vehicleID") VALUES ('bles', 0, 0, NULL, '/images/', 0, 1293, NULL, '392983892', 'makde', 'Le Car', 0, 'STS', '20412')
---
  def create
    @vehicle = Vehicle.new(params[:vehicle])
    if @vehicle.image_url=='/images/'
      @vehicle.image_url='/images/5_Le_car_modele.jpg'
    end
    respond_to do |format|
      if @vehicle.save

SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94132'))
UPDATE "vehicles" SET "hows_my_driving" = '906LR', "alias" = 'Power Van', "needs_gas" = 0, "service_comments" = '', "reserved" = 0, "checked_out" = 1, "image_url" = '/images/94237.jpg', "needs_service" = 1, "service_timestamp" = NULL, "year_made" = 2002, "model" = 'Windstar', "parking_id" = '11047036', "make" = 'Ford', "owner" = 'STS' WHERE ("vehicleID" = '94237')
---
  def update

	  @vehicle = Vehicle.find(params[:id])
    respond_to do |format|
      if @vehicle.update_attributes(params[:vehicle])

SELECT * FROM "vehicles" WHERE (("vehicles"."vehicleID"='94237'))
SELECT * FROM "trips" WHERE ("trips"."vehicle_id" = '94237')
SELECT * FROM "vehicles"
---
	def show_report
	  @vehicle = Vehicle.find(params[:vehicle][:vehicle])
	  trips = Trip.find_all_by_vehicle_id(@vehicle.vehicleID)
	  @total_trips = trips.length